Revit 2026 API

# GenericGenericTransparency Property

---

The property labeled "Transparency" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericTransparency { get; }
```
```vb
Public Shared ReadOnly Property GenericTransparency As String
	Get
```
```cpp
public:
static property String^ GenericTransparency {
	String^ get ();
}
```
```fsharp
static member GenericTransparency : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1". This property allows a connected asset.

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace